/*本质上是以每一个元素为首的4次其余三元素排列,代码由c语言编写*/

#include<stdio.h>

void swap(char* a,char* b)

{

char t;

t = *a;

*a = *b;

*b = t;

}

//交换函数。用地址没用声明，个人习惯



int P(char a[],int x, int y)    ​/​/具体全排列函数，传入数组a，首元素下标，末元素下标 i:注意，首元素下表指的是传入全排列函数的需要进行排列操作的第一个元素[0,y]

{

	if(x==y)    ​    ​    ​    ​    ​ //递归终止边界条件：当前正在做末尾单元素的全排列，此时可以打印当前次的序列

	{

	printf("%s\n",a);    ​    ​//打印当前序列

	}

	else    ​    ​    ​    ​    ​    ​    ​//当前次序列还未交换完毕，继续交换

	{

		for(int i=x;i<=y;i++)

		{

		swap(&a[i],&a[x]);    ​//对当前操作的数组每个元素和首元素交换

		P(a,x+1,y);    ​    ​    ​    ​//对长度-1的数组进行全排列

		swap(&a[i],&a[x]);    ​//交换回来，下一次循环换下一个元素和首元素交换

		

		}

	

	}





return 0;    ​    ​//返回上层

}





int main ()

{

char e[4]={'A','B','C','D'};    ​//构建数组

P(e,0,3);    ​//a,0,3可变,理论上可以推广到任何字符序列全排列 5678...个元素都行

}

///////////////////////////////////////